import cv2
import numpy as np

img = cv2.imread('./img/blank_500.jpg')
#원점 150,150, 반지름 100
cv2.circle(img, (150, 150), 100, (200, 0, 200), 1, cv2.LINE_AA)
#원점 300,150, 반지름 70
cv2.circle(img, (300, 150), 70, (200, 200, 0), 5, cv2.LINE_AA)
#원점 400,140, 반지름50, 채우기
cv2.circle(img, (400, 140), 50, (200, 50, 50), -1, cv2.LINE_AA)

#원점 50,300, 반지름50, 회전0, 0도부터 360도 그리기
cv2.ellipse(img, (50, 300), (50, 50), 0, 0, 360, (200, 100, 100))
#원점 150,300, 아래반원 그리기
cv2.ellipse(img, (150, 300), (50,50), 0, 0, 180, (255,0,0), -1)
#원점 200,300, 위 반원 그리기
cv2.ellipse(img, (200, 300), (50,50), 0, 181, 360, (0,0,255))

#원점 325, 300, 반지름 75, 50 ==(x축길이 75, y축길이 50)
cv2.ellipse(img, (325, 300), (75, 50), 0, 0, 360, (0, 250, 10), -1)
#원점 450, 300, 반지름 50, 75
cv2.ellipse(img, (450, 300), (50, 75), 0, 0, 360, (255, 0, 255), -1, cv2.LINE_AA)

#원점 50, 425, 반지름 50, 75, 회전 15도
cv2.ellipse(img, (50, 425), (50, 75), 15, 0, 360, (200, 243, 122), 1, cv2.LINE_AA)
#원점 200, 425, 반지름 50, 75, 회전 45도
cv2.ellipse(img, (200, 425), (50, 75), 45, 0, 360, (200, 243, 122), 1, cv2.LINE_AA)

#원점 350, 425, 반지름 50, 75, 회전 45도 후 아래반원
cv2.ellipse(img, (350,425), (50, 75), 45, 0, 180, (0, 0, 255), 1, cv2.LINE_AA)
#원점 400, 425, 반지름 50, 75, 회전 45도 후 위반원
cv2.ellipse(img, (400, 425), (50, 75), 45, 181, 360, (255, 0, 0), 1, cv2.LINE_AA)

cv2.imshow('circle', img)
cv2.waitKey(0)
cv2.destroyAllWindows()