import cv2

img = cv2.imread("C:\\Users\\rnltl\\Desktop\\VISUALCODE\\openCV\\blank_500.jpg")

cv2.line(img, (50, 50), (150, 50), (255, 0, 0))     #x:50~150까지 y:50 인 1픽셀 선(파랑)
cv2.line(img, (200, 50), (300, 50), (0, 255, 0))    #x:200~300까지 y:50 인 1픽셀 선(초록)
cv2.line(img, (350, 50), (450, 50), (0, 0, 255))    #x:350~450까지 y:50 인 1픽셀 선(빨강)

#하늘색(파+초) 10픽셀 선
cv2.line(img, (100, 100), (400, 100), (255, 255, 0), 10)
#분홍색(파+빨) 10픽셀 선
cv2.line(img, (100, 150), (400, 150), (255, 0, 255), 10)
#노란색(빨+초) 10픽셀 선
cv2.line(img, (100, 200), (400, 200), (0, 255, 255), 10)
#회색(빨+파+초) 10픽셀 선
cv2.line(img, (100, 250), (400, 250), (200, 200, 200), 10)
#검은색 10픽셀 선
cv2.line(img, (100, 300), (400, 300), (0, 0, 0), 10)

#4연결 선
cv2.line(img, (100, 350), (400, 400), (0, 0, 255), 35, cv2.LINE_4)
#8연결 선
cv2.line(img, (100, 400), (400, 450), (0, 0, 255), 35, cv2.LINE_8)
#안티에일리어싱 선
cv2.line(img, (100, 450), (400, 500), (0, 0, 255), 35, cv2.LINE_AA)
#이미지 전체에 대각선
cv2.line(img, (0, 0), (500, 500), (0, 0, 255))

cv2.imshow('lines', img)
cv2.waitKey(0)
cv2.destroyAllWindows()
